print("猜生日日期遊戲，請回答下列5個問題，這個程式即可列出你的生日")

questions = [
    "1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31",
    "2, 3, 6, 7, 10, 11, 14, 15, 18, 19, 22, 23, 26, 27, 30, 31",
    "4, 5, 6, 7, 12, 13, 14, 15, 20, 21, 22, 23, 28, 29, 30, 31",
    "8, 9, 10, 11, 12, 13, 14, 15, 24, 25, 26, 27, 28, 29, 30, 31",
    "16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31"
]

birthday = 0

for i in range(5):
    print("有沒有看到自己的生日日期？")
    print(questions[i])
    answer = input("輸入 y 或 Y 代表有，其他代表無：")
    if answer.lower() == 'y':
        birthday += 2**i

print(f"讀者的生日日期是：{birthday}")
